REGULAR_WEEK_TEMPLATE = "Астрологи объявляют неделю <b>{beast}</b>.\n Население всех жилищ возросло."
SPECIAL_WEEK_TEMPLATE = (
    "Астрологи объявляют, что этой неделе покровительствует сила <b>{beasts}</b>.\n"
    "Популяция <b>{beasts}</b> +5.\n"
    "Население всех жилищ возросло."
)
PLAGUE_MONTH_MESSAGE = "Астрологи объявляют месяц ЧУМЫ!\nНаселение всех жилищ уменьшилось вдвое."
REGULAR_MONTH_MESSAGE = "Астрологи объявляют месяц <b>{unit}</b>.\n Население всех жилищ возросло."
SPECIAL_MONTH_MESSAGE = (
    "Астрологи объявляют, что этому месяцу покровительствует сила <b>{unit}</b>.\n"
    "Популяция <b>{unit}</b> удваивается!\n"
    "Население всех жилищ возросло"
)
REGULAR_WEEK_UNIT = (
    "белки",
    "кролика",
    "суслика",
    "барсука",
    "крысы",
    "орла",
    "горностая",
    "ворона",
    "мангуста",
    "собаки",
    "муравьеда",
    "ящерицы",
    "черепахи",
    "дикобраза",
    "кондора",
)

# https://homm3sod.ru/units/
PLAYABLE_UNITS = (
    "копейщиков",
    "алебардщиков",
    "лучников",
    "стрелоков",
    "грифонов",
    "королевский грифонов",
    "крестоносецев",
    "монахов",
    "фанатиков",
    "кавалеристов",
    "чемпионов",
    "ангелов",
    "архангелов",
)
REGULAR_MONTH_UNIT = (
    "кузнечика",
    "муравья",
    "стрекозы",
    "паука",
    "бабочки",
    "шмеля",
    "цикады",
    "земляного червя",
    "шершня",
    "жука",
)
